espressif/esp-idf/components/soc/esp32h2/register/soc/gdma_struct.h
/** Type of out_int_clr_chn register
 *  Interrupt clear bits of channel 0
 */
typedef union {
    struct {
        /** out_done_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear the OUT_DONE_CH_INT interrupt.
         */
        uint32_t out_done_int_clr:1;
        /** out_eof_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear the OUT_EOF_CH_INT interrupt.
         */
        uint32_t out_eof_int_clr:1;
        /** out_dscr_err_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.
         */
        uint32_t out_dscr_err_int_clr:1;
        /** out_total_eof_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.
         */
        uint32_t out_total_eof_int_clr:1;
        /** outfifo_ovf_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_ovf_int_clr:1;
        /** outfifo_udf_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.
         */
        uint32_t outfifo_udf_int_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_out_int_clr_chn_reg_t;


/** Group: Debug Registers */
/** Type of ahb_test register
 *  reserved
 */
typedef union {
    struct {
        /** ahb_testmode : R/W; bitpos: [2:0]; default: 0;
         *  reserved
         */
        uint32_t ahb_testmode:3;
        uint32_t reserved_3:1;
        /** ahb_testaddr : R/W; bitpos: [5:4]; default: 0;
         *  reserved
         */
        uint32_t ahb_testaddr:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_ahb_test_reg_t;


/** Group: Configuration Registers */
/** Type of misc_conf register
 *  MISC register
 */
typedef union {
    struct {
        /** ahbm_rst_inter : R/W; bitpos: [0]; default: 0;
         *  Set this bit then clear this bit to reset the internal ahb FSM.
         */
        uint32_t ahbm_rst_inter:1;
        uint32_t reserved_1:1;
        /** arb_pri_dis : R/W; bitpos: [2]; default: 0;
         *  Set this bit to disable priority arbitration function.
         */
        uint32_t arb_pri_dis:1;
        /** clk_en : R/W; bitpos: [3]; default: 0;
         *  1'h1: Force clock on for register. 1'h0: Support clock only when application writes
         *  registers.
         */
        uint32_t clk_en:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gdma_misc_conf_reg_t;

/** Type of in_conf0_chn register
 *  Configure 0 register of Rx channel 0
 */
typedef union {
    struct {
        /** in_rst : R/W; bitpos: [0]; default: 0;
         *  This bit is used to reset DMA channel 0 Rx FSM and Rx FIFO pointer.
         */
        uint32_t in_rst:1;
        /** in_loop_test : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t in_loop_test:1;
        /** indscr_burst_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Rx channel 0 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t indscr_burst_en:1;
        /** in_data_burst_en : R/W; bitpos: [3]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Rx channel 0 receiving data
         *  when accessing internal SRAM.
         */
        uint32_t in_data_burst_en:1;
        /** mem_trans_en : R/W; bitpos: [4]; default: 0;
         *  Set this bit 1 to enable automatic transmitting data from memory to memory via DMA.
         */
        uint32_t mem_trans_en:1;
        /** in_etm_en : R/W; bitpos: [5]; default: 0;
         *  Set this bit to 1 to enable etm control mode, dma Rx channel 0 is triggered by etm
         *  task.
         */
        uint32_t in_etm_en:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_in_conf0_chn_reg_t;

/** Type of in_conf1_chn register
 *  Configure 1 register of Rx channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** in_check_owner : R/W; bitpos: [12]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t in_check_owner:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} gdma_in_conf1_chn_reg_t;

/** Type of in_pop_chn register
 *  Pop control register of Rx channel 0
 */
typedef union {
    struct {
        /** infifo_rdata : RO; bitpos: [11:0]; default: 2048;
         *  This register stores the data popping from DMA FIFO.
         */
        uint32_t infifo_rdata:12;
        /** infifo_pop : WT; bitpos: [12]; default: 0;
         *  Set this bit to pop data from DMA FIFO.
         */
        uint32_t infifo_pop:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} gdma_in_pop_chn_reg_t;

/** Type of in_link_chn register
 *  Link descriptor configure and control register of Rx channel 0
 */
typedef union {
    struct {
        /** inlink_addr : R/W; bitpos: [19:0]; default: 0;
         *  This register stores the 20 least significant bits of the first inlink descriptor's
         *  address.
         */
        uint32_t inlink_addr:20;
        /** inlink_auto_ret : R/W; bitpos: [20]; default: 1;
         *  Set this bit to return to current inlink descriptor's address when there are some
         *  errors in current receiving data.
         */
        uint32_t inlink_auto_ret:1;
        /** inlink_stop : WT; bitpos: [21]; default: 0;
         *  Set this bit to stop dealing with the inlink descriptors.
         */
        uint32_t inlink_stop:1;
        /** inlink_start : WT; bitpos: [22]; default: 0;
         *  Set this bit to start dealing with the inlink descriptors.
         */
        uint32_t inlink_start:1;
        /** inlink_restart : WT; bitpos: [23]; default: 0;
         *  Set this bit to mount a new inlink descriptor.
         */
        uint32_t inlink_restart:1;
        /** inlink_park : RO; bitpos: [24]; default: 1;
         *  1: the inlink descriptor's FSM is in idle state.  0: the inlink descriptor's FSM is
         *  working.
         */
        uint32_t inlink_park:1;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} gdma_in_link_chn_reg_t;

/** Type of out_conf0_chn register
 *  Configure 0 register of Tx channel 0
 */
typedef union {
    struct {
        /** out_rst : R/W; bitpos: [0]; default: 0;
         *  This bit is used to reset DMA channel 0 Tx FSM and Tx FIFO pointer.
         */
        uint32_t out_rst:1;
        /** out_loop_test : R/W; bitpos: [1]; default: 0;
         *  reserved
         */
        uint32_t out_loop_test:1;
        /** out_auto_wrback : R/W; bitpos: [2]; default: 0;
         *  Set this bit to enable automatic outlink-writeback when all the data in tx buffer
         *  has been transmitted.
         */
        uint32_t out_auto_wrback:1;
        /** out_eof_mode : R/W; bitpos: [3]; default: 1;
         *  EOF flag generation mode when transmitting data. 1: EOF flag for Tx channel 0 is
         *  generated when data need to transmit has been popped from FIFO in DMA
         */
        uint32_t out_eof_mode:1;
        /** outdscr_burst_en : R/W; bitpos: [4]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 reading link
         *  descriptor when accessing internal SRAM.
         */
        uint32_t outdscr_burst_en:1;
        /** out_data_burst_en : R/W; bitpos: [5]; default: 0;
         *  Set this bit to 1 to enable INCR burst transfer for Tx channel 0 transmitting data
         *  when accessing internal SRAM.
         */
        uint32_t out_data_burst_en:1;
        /** out_etm_en : R/W; bitpos: [6]; default: 0;
         *  Set this bit to 1 to enable etm control mode, dma Tx channel 0 is triggered by etm
         *  task.
         */
        uint32_t out_etm_en:1;
        uint32_t reserved_7:25;
    };
    uint32_t val;
} gdma_out_conf0_chn_reg_t;

/** Type of out_conf1_chn register
 *  Configure 1 register of Tx channel 0
 */
typedef union {
    struct {
        uint32_t reserved_0:12;
        /** out_check_owner : R/W; bitpos: [12]; default: 0;
         *  Set this bit to enable checking the owner attribute of the link descriptor.
         */
        uint32_t out_check_owner:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} gdma_out_conf1_chn_reg_t;

/** Type of out_push_chn register
 *  Push control register of Rx channel 0
 */
typedef union {
    struct {
        /** outfifo_wdata : R/W; bitpos: [8:0]; default: 0;
         *  This register stores the data that need to be pushed into DMA FIFO.
         */
        uint32_t outfifo_wdata:9;
        /** outfifo_push : WT; bitpos: [9]; default: 0;
         *  Set this bit to push data into DMA FIFO.
         */
        uint32_t outfifo_push:1;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} gdma_out_push_chn_reg_t;

