espressif/esp-idf/components/soc/esp32h2/register/soc/gdma_struct.h
/** Type of out_dscr_chn register
 *  Current inlink descriptor address of Tx channel 0
 */
typedef union {
    struct {
        /** outlink_dscr : RO; bitpos: [31:0]; default: 0;
         *  The address of the current outlink descriptor y.
         */
        uint32_t outlink_dscr:32;
    };
    uint32_t val;
} gdma_out_dscr_chn_reg_t;

/** Type of out_dscr_bf0_chn register
 *  The last inlink descriptor address of Tx channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf0 : RO; bitpos: [31:0]; default: 0;
         *  The address of the last outlink descriptor y-1.
         */
        uint32_t outlink_dscr_bf0:32;
    };
    uint32_t val;
} gdma_out_dscr_bf0_chn_reg_t;

/** Type of out_dscr_bf1_chn register
 *  The second-to-last inlink descriptor address of Tx channel 0
 */
typedef union {
    struct {
        /** outlink_dscr_bf1 : RO; bitpos: [31:0]; default: 0;
         *  The address of the second-to-last inlink descriptor x-2.
         */
        uint32_t outlink_dscr_bf1:32;
    };
    uint32_t val;
} gdma_out_dscr_bf1_chn_reg_t;


/** Group: Priority Registers */
/** Type of in_pri_chn register
 *  Priority register of Rx channel 0
 */
typedef union {
    struct {
        /** rx_pri : R/W; bitpos: [3:0]; default: 0;
         *  The priority of Rx channel 0. The larger of the value the higher of the priority.
         */
        uint32_t rx_pri:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gdma_in_pri_chn_reg_t;

/** Type of out_pri_chn register
 *  Priority register of Tx channel 0.
 */
typedef union {
    struct {
        /** tx_pri : R/W; bitpos: [3:0]; default: 0;
         *  The priority of Tx channel 0. The larger of the value the higher of the priority.
         */
        uint32_t tx_pri:4;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} gdma_out_pri_chn_reg_t;


/** Group: Peripheral Select Registers */
/** Type of in_peri_sel_chn register
 *  Peripheral selection of Rx channel 0
 */
typedef union {
    struct {
        /** peri_in_sel : R/W; bitpos: [5:0]; default: 63;
         *  This register is used to select peripheral for Rx channel 0. 0:SPI2. 1: reserved.
         *  2: UHCI0. 3: I2S0. 4: reserved. 5: reserved. 6: AES. 7: SHA. 8: ADC_DAC. 9:
         *  Parallel_IO.
         */
        uint32_t peri_in_sel:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_in_peri_sel_chn_reg_t;

/** Type of out_peri_sel_chn register
 *  Peripheral selection of Tx channel 0
 */
typedef union {
    struct {
        /** peri_out_sel : R/W; bitpos: [5:0]; default: 63;
         *  This register is used to select peripheral for Tx channel 0. 0:SPI2. 1: reserved.
         *  2: UHCI0. 3: I2S0. 4: reserved. 5: reserved. 6: AES. 7: SHA. 8: ADC_DAC. 9:
         *  Parallel_IO.
         */
        uint32_t peri_out_sel:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} gdma_out_peri_sel_chn_reg_t;

typedef struct {
    volatile gdma_in_int_raw_chn_reg_t raw;
    volatile gdma_in_int_st_chn_reg_t st;
    volatile gdma_in_int_ena_chn_reg_t ena;
    volatile gdma_in_int_clr_chn_reg_t clr;
} gdma_in_int_chn_reg_t;

typedef struct {
    volatile gdma_out_int_raw_chn_reg_t raw;
    volatile gdma_out_int_st_chn_reg_t st;
    volatile gdma_out_int_ena_chn_reg_t ena;
    volatile gdma_out_int_clr_chn_reg_t clr;
} gdma_out_int_chn_reg_t;

typedef struct {
    volatile gdma_in_conf0_chn_reg_t in_conf0;
    volatile gdma_in_conf1_chn_reg_t in_conf1;
    volatile gdma_infifo_status_chn_reg_t infifo_status;
    volatile gdma_in_pop_chn_reg_t in_pop;
    volatile gdma_in_link_chn_reg_t in_link;
    volatile gdma_in_state_chn_reg_t in_state;
    volatile gdma_in_suc_eof_des_addr_chn_reg_t in_suc_eof_des_addr;
    volatile gdma_in_err_eof_des_addr_chn_reg_t in_err_eof_des_addr;
    volatile gdma_in_dscr_chn_reg_t in_dscr;
    volatile gdma_in_dscr_bf0_chn_reg_t in_dscr_bf0;
    volatile gdma_in_dscr_bf1_chn_reg_t in_dscr_bf1;
    volatile gdma_in_pri_chn_reg_t in_pri;
    volatile gdma_in_peri_sel_chn_reg_t in_peri_sel;
} gdma_in_chn_reg_t;

typedef struct {
    volatile gdma_out_conf0_chn_reg_t out_conf0;
    volatile gdma_out_conf1_chn_reg_t out_conf1;
    volatile gdma_outfifo_status_chn_reg_t outfifo_status;
    volatile gdma_out_push_chn_reg_t out_push;
    volatile gdma_out_link_chn_reg_t out_link;
    volatile gdma_out_state_chn_reg_t out_state;
    volatile gdma_out_eof_des_addr_chn_reg_t out_eof_des_addr;
    volatile gdma_out_eof_bfr_des_addr_chn_reg_t out_eof_bfr_des_addr;
    volatile gdma_out_dscr_chn_reg_t out_dscr;
    volatile gdma_out_dscr_bf0_chn_reg_t out_dscr_bf0;
    volatile gdma_out_dscr_bf1_chn_reg_t out_dscr_bf1;
    volatile gdma_out_pri_chn_reg_t out_pri;
    volatile gdma_out_peri_sel_chn_reg_t out_peri_sel;
} gdma_out_chn_reg_t;

typedef struct {
    volatile gdma_in_chn_reg_t in;
    uint32_t reserved_in[11];
    volatile gdma_out_chn_reg_t out;
    uint32_t reserved_out[11];
} gdma_chn_reg_t;


typedef struct gdma_dev_s {
    volatile gdma_in_int_chn_reg_t in_intr[3];
    volatile gdma_out_int_chn_reg_t out_intr[3];
    volatile gdma_ahb_test_reg_t ahb_test;
    volatile gdma_misc_conf_reg_t misc_conf;
    volatile gdma_date_reg_t date;
    uint32_t reserved_06c;
    volatile gdma_chn_reg_t channel[3];
} gdma_dev_t;

extern gdma_dev_t GDMA;

#ifndef __cplusplus
_Static_assert(sizeof(gdma_dev_t) == 0x2B0, "Invalid size of gdma_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
